// 抖音脚本任务开始

var name= app.getPackageName('抖音极速版')// 打开抖音应用
app.launch(name)
sleep(5000)

// 点击来赚钱
click(573,2249);



/**签到模块 */
// sleep(2000)

// if(text('签到提醒').exists()){ // 判断是否'签到提醒'弹出层

//     console.log('发现-----签到模块')

// }


/**看视频 */ 
sleep(2000)

if(text('看广告赚金币').exists()){      // 判断'看广告视频'

    console.log('发现----看广告赚金币')
    text('看广告赚金币').findOne().clickCenter()    // 点击进入广告查看

    // 获取播放时长
    // 等待播放时长过后'可领取奖励'
    // 获取进入下载页面的'返回'按钮
    // 点击返回
    // 获取视频播放页面'关闭，按钮、'

    // 点击'关闭，按钮'
    // 判断是否'再看一个视频额外获得'
    // 点击'领取奖励',在看一条视频

    // 获取播放时长过后'可领取奖励'
    // 进入软件下载页面，获取'返回'按钮
    // 点击返回
    // 获取视频播放页面'关闭，按钮、'




}



/**开宝箱 */ 
// if(text('开宝箱得金币').exists()){      // 判断'看广告视频'

//     console.log('发现----宝箱')

// }




// // 退出应用
// sleep(2000)
// home() // 回到主页


// // 结束当前任务
// sleep(2000)
// recents() // 显示任务
// sleep(2000)
// swipe(600,1800,600,1000,1000)
// home() // 回到主页

